Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2020 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        4. May 2020
 * $Revision:    V2.15
 *
 * Driver:       Driver_SPI1, Driver_SPI2, Driver_SPI3,
 *               Driver_SPI4, Driver_SPI5, Driver_SPI6
 * Configured:   via RTE_Device.h configuration file
 * Project:      SPI Driver for ST STM32F4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   SPI Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_SPI# = 1       use SPI1
 *   Connect to hardware via Driver_SPI# = 2       use SPI2
 *   Connect to hardware via Driver_SPI# = 3       use SPI3
 *   Connect to hardware via Driver_SPI# = 4       use SPI4
 *   Connect to hardware via Driver_SPI# = 5       use SPI5
 *   Connect to hardware via Driver_SPI# = 6       use SPI6
 * --------------------------------------------------------------------------
 *
 * When RTE_DEVICE_FRAMEWORK_CLASSIC is used:
 *  SPI IO Speed frequencies can be defined by preprocessor:
 *  SPIx_GPIO_SPEED_FREQ (where x = 1..6) can be defined as
 *    GPIO_SPEED_FREQ_LOW, GPIO_SPEED_FREQ_MEDIUM, 
 *    GPIO_SPEED_FREQ_HIGH or GPIO_SPEED_FREQ_VERY_HIGH
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 2.15
 *    Corrected PowerControl function to:
 *      - return error if Initialize was not called
 *      - abort active transfer if power off was requested
 *    Updated GetDataCount function to give accurate count in DMA mode
 *    Corrected Control function:
 *      - to flush loaded data register if abort was requested in DMA mode
 *      - operation of slave with Slave Select software controlled
 *      - selection of Texas Instruments Frame Format
 *      - to ignore bus speed setting for slave mode
 *    Corrected Uninitialize function to power off the peripheral if it is powered
 *  Version 2.14
 *    Corrected SPI3_SCK pin configuration
 *  Version 2.13
 *    Corrected DMA MemDataAlignment configuration.
 *  Version 2.12
 *    Added checking if pointer to SPI_PIN is valid, before it is used
 *  Version 2.11
 *    Corrected data shift register overrun in master mode
 *  Version 2.10
 *    Added support for ARM Compiler 6
 *  Version 2.9
 *    I/O output speed is configurable
 *  Version 2.8
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *    Corrected 8bit/16bit Data register access, regarding the Data frame size
 *    Corrected Bus Speed configuration
 *  Version 2.7
 *    Added support for STM32F410xx
 *  Version 2.6
 *    PowerControl for Power OFF and Uninitialize functions made unconditional.
 *    Corrected status bit-field handling, to prevent race conditions.
 *  Version 2.5
 *    Added support for STM32F446xx
 *  Version 2.4
 *    Corrected ARM_SPI_EVENT_DATA_LOST event generation in master mode at high bus speeds
 *  Version 2.3
 *    Corrected bus speed configuration
 *  Version 2.2
 *    Corrected spi->info->mode handling
 *  Version 2.1
 *    STM32CubeMX generated code can also be used to configure the driver
 *  Version 2.0
 *    Updated to CMSIS Driver API V2.00
 *    Added SPI4 and SPI6
 *  Version 1.4
 *    Added SPI5
 *  Version 1.3
 *    Event send_data_event added to capabilities
 *    SPI IRQ handling corrected
 *  Version 1.2
 *    Based on API V1.10 (namespace prefix ARM_ added)
 *  Version 1.1
 *    Corrections for configuration without DMA
 *  Version 1.0
 *    Initial release
 */
 
  /*! \page stm32f4_spi CMSIS-Driver SPI Setup 

The CMSIS-Driver SPI requires:
  - Setup of SPIx input clock
  - Setup of SPIx in Full-Duplex Master/Slave mode with optional DMA for Rx and Tx transfers

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | MCBSTM32F400                  | STM32F4-Discovery             | 32F401C-Discovery             | 32F429I-Discovery
:-------------------|:------------------------------|:------------------------------|:------------------------------|:------------------
SPI Mode            |SPI2: <b>Full-Duplex Master</b>|SPI1: <b>Full-Duplex Master</b>|SPI1: <b>Full-Duplex Master</b>|SPI5: <b>Full-Duplex Master</b>
MOSI pin            |PB15                           |PA7                            |PA7                            |PF9
MISO pin            |PB14                           |PA6                            |PA6                            |PF8
SCK pin             |PB10                           |PA5                            |PA5                            |PF7
NSS pin             |PB12                           |PE3                            |PE3                            |PC1

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for MCBSTM32F400 with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.

Pinout tab
----------
  1. Configure mode
    - Peripherals \b SPI2: Mode=<b>Full-Duplex Master</b>, Hardware NSS Signal=<b>ON</b>

  2. Configure pins PB15, PB14, PB10 and pin PB12 as SPI2 peripheral alternative pins
    - Click in chip diagram on pin \b PB15 and select \b SPI2_MOSI
    - Click in chip diagram on pin \b PB14 and select \b SPI2_MISO
    - Click in chip diagram on pin \b PB10 and select \b SPI2_SCK
    - Click in chip diagram on pin \b PB12 and select \b SPI2_NSS

