Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
Clock Configuration tab
-----------------------
  1. Configure APB2 clock
    - Setup "APB2 peripheral clocks (MHz)" to match application requirements

Configuration tab
-----------------
  1. Under Connectivity open \b SPI2 Configuration:
     - \e optional <b>DMA Settings</b>: setup DMA transfers for Rx and Tx\n
       \b Add - Select \b SPI2_RX: Stream=DMA1 Stream 3, Direction=Peripheral to Memory, Priority=Low,
          DMA Request Settings: not used\n
       \b Add - Select \b SPI2_TX: Stream=DMA1 Stream 4, Direction=Memory to Peripheral, Priority=Low,
          DMA Request Settings: not used

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PB10     | SPI2_SCK      | Alternate | No pull-up and no..| High        |.
          PB12     | SPI2_NSS      | Alternate | No pull-up and no..| High        |.
          PB14     | SPI2_MISO     | Alternate | No pull-up and no..| High        |.
          PB15     | SPI2_MOSI     | Alternate | No pull-up and no..| High        |.

     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                      | Enable | Preemption Priority | Sub Priority
          :------------------------------------|:-------|:--------------------|:--------------
          DMA1 stream3 global interrupt        |   ON   | 0                   | 0
          DMA1 stream4 global interrupt        |   ON   | 0                   | 0
          SPI2 global interrupt                |\b ON   | 0                   | 0

     - Parameter Settings: not used
     - User Constants: not used
   
     Click \b OK to close the SPI2 Configuration dialog
*/

/*! \cond */

#include "SPI_STM32F4xx.h"

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,15)

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SPI_API_VERSION, ARM_SPI_DRV_VERSION };

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  1,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1   /* Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT */
#if (defined(ARM_SPI_API_VERSION) && (ARM_SPI_API_VERSION >= 0x202U))
, 0U  /* Reserved bits */
#endif
};

static ARM_SPI_CAPABILITIES SPIX_GetCapabilities (void);
static int32_t              SPI_Initialize       (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi);
static int32_t              SPI_Uninitialize     (const SPI_RESOURCES *spi);
static int32_t              SPI_PowerControl     (ARM_POWER_STATE state, const SPI_RESOURCES *spi);
static int32_t              SPI_Send             (const void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Receive          (void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Transfer         (const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi);
static uint32_t             SPI_GetDataCount     (const SPI_RESOURCES *spi);
static int32_t              SPI_Control          (uint32_t control, uint32_t arg, const SPI_RESOURCES *spi);
static ARM_SPI_STATUS       SPI_GetStatus        (const SPI_RESOURCES *spi);
static uint32_t             SPI_TxData           (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer);
static uint32_t             SPI_RxData           (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer);

#ifdef MX_SPI1

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi1;
#endif

// SPI1 Run-Time Information
static SPI_INFO          SPI1_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI1_TransferInfo;


#ifdef MX_SPI1_MOSI_Pin
  static SPI_PIN SPI1_mosi = {MX_SPI1_MOSI_GPIOx, MX_SPI1_MOSI_GPIO_Pin, MX_SPI1_MOSI_GPIO_AF, MX_SPI1_MOSI_GPIO_PuPd, MX_SPI1_MOSI_GPIO_Speed, 0U };
#endif
#ifdef MX_SPI1_MISO_Pin
  static SPI_PIN SPI1_miso = {MX_SPI1_MISO_GPIOx, MX_SPI1_MISO_GPIO_Pin, MX_SPI1_MISO_GPIO_AF, MX_SPI1_MISO_GPIO_PuPd, MX_SPI1_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI1_SCK_Pin
  static SPI_PIN SPI1_sck  = {MX_SPI1_SCK_GPIOx,  MX_SPI1_SCK_GPIO_Pin,  MX_SPI1_SCK_GPIO_AF,  MX_SPI1_SCK_GPIO_PuPd,  MX_SPI1_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI1_NSS_Pin
  static SPI_PIN SPI1_nss  = {MX_SPI1_NSS_GPIOx,  MX_SPI1_NSS_GPIO_Pin,  MX_SPI1_NSS_GPIO_AF,  MX_SPI1_NSS_GPIO_PuPd,  MX_SPI1_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI1_RX_DMA_Instance
  static void SPI1_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef  hdma_spi1_rx;
#else
  extern DMA_HandleTypeDef  hdma_spi1_rx;
#endif
  static SPI_DMA SPI1_DMA_Rx = {
    &hdma_spi1_rx,
    SPI1_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI1_RX_DMA_Instance,
    MX_SPI1_RX_DMA_Channel,
    MX_SPI1_RX_DMA_Priority,
    MX_SPI1_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_SPI1_TX_DMA_Instance
  static void SPI1_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi1_tx;
#else
  extern DMA_HandleTypeDef hdma_spi1_tx;
#endif
  static SPI_DMA SPI1_DMA_Tx = {
    &hdma_spi1_tx,
    SPI1_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI1_TX_DMA_Instance,
    MX_SPI1_TX_DMA_Channel,
    MX_SPI1_TX_DMA_Priority,
    MX_SPI1_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// SPI1 Resources
static const SPI_RESOURCES SPI1_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi1,
#endif
  SPI1,
  HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_SPI1_MOSI_Pin
    &SPI1_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI1_MISO_Pin
    &SPI1_miso,
#else
    NULL,
#endif
#ifdef MX_SPI1_SCK_Pin
    &SPI1_sck,
#else
    NULL,
#endif
#ifdef MX_SPI1_NSS_Pin 
    &SPI1_nss,
#else
    NULL,
#endif
  },

  SPI1_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI1_RX_DMA_Instance
  &SPI1_DMA_Rx,
#else
  NULL,
#endif

