Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
#ifdef MX_SPI1_TX_DMA_Instance
  &SPI1_DMA_Tx,
#else
  NULL,
#endif

  &SPI1_Info,
  &SPI1_TransferInfo
};
#endif /* MX_SPI1 */

#ifdef MX_SPI2

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi2;
#endif

// SPI2 Run-Time Information
static SPI_INFO          SPI2_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI2_TransferInfo;


#ifdef MX_SPI2_MOSI_Pin
  static SPI_PIN SPI2_mosi = {MX_SPI2_MOSI_GPIOx, MX_SPI2_MOSI_GPIO_Pin, MX_SPI2_MOSI_GPIO_AF, MX_SPI2_MOSI_GPIO_PuPd, MX_SPI2_MOSI_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI2_MISO_Pin
  static SPI_PIN SPI2_miso = {MX_SPI2_MISO_GPIOx, MX_SPI2_MISO_GPIO_Pin, MX_SPI2_MISO_GPIO_AF, MX_SPI2_MISO_GPIO_PuPd, MX_SPI2_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI2_SCK_Pin
  static SPI_PIN SPI2_sck  = {MX_SPI2_SCK_GPIOx,  MX_SPI2_SCK_GPIO_Pin,  MX_SPI2_SCK_GPIO_AF,  MX_SPI2_SCK_GPIO_PuPd,  MX_SPI2_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI2_NSS_Pin
  static SPI_PIN SPI2_nss  = {MX_SPI2_NSS_GPIOx,  MX_SPI2_NSS_GPIO_Pin,  MX_SPI2_NSS_GPIO_AF,  MX_SPI2_NSS_GPIO_PuPd,  MX_SPI2_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI2_RX_DMA_Instance
  static void SPI2_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi2_rx;
#else
  extern DMA_HandleTypeDef hdma_spi2_rx;
#endif
  static SPI_DMA SPI2_DMA_Rx = {
    &hdma_spi2_rx,
    SPI2_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI2_RX_DMA_Instance,
    MX_SPI2_RX_DMA_Channel,
    MX_SPI2_RX_DMA_Priority,
    MX_SPI2_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif 
#ifdef MX_SPI2_TX_DMA_Instance
  static void SPI2_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi2_tx;
#else
  extern DMA_HandleTypeDef hdma_spi2_tx;
#endif
  static SPI_DMA SPI2_DMA_Tx = {
    &hdma_spi2_tx,
    SPI2_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI2_TX_DMA_Instance,
    MX_SPI2_TX_DMA_Channel,
    MX_SPI2_TX_DMA_Priority,
    MX_SPI2_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// SPI2 Resources
static const SPI_RESOURCES SPI2_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi2,
#endif
  SPI2,
  HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_SPI2_MOSI_Pin
    &SPI2_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI2_MISO_Pin
    &SPI2_miso,
#else
    NULL,
#endif
#ifdef MX_SPI2_SCK_Pin
    &SPI2_sck,
#else
    NULL,
#endif
#ifdef MX_SPI2_NSS_Pin 
    &SPI2_nss,
#else
    NULL,
#endif
  },

  SPI2_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI2_RX_DMA_Instance
  &SPI2_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI2_TX_DMA_Instance
  &SPI2_DMA_Tx,
#else
  NULL,
#endif

  &SPI2_Info,
  &SPI2_TransferInfo
};
#endif /* MX_SPI2 */

#ifdef MX_SPI3

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi3;
#endif

// SPI3 Run-Time Information
static SPI_INFO          SPI3_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI3_TransferInfo;


#ifdef MX_SPI3_MOSI_Pin
  static SPI_PIN SPI3_mosi = {MX_SPI3_MOSI_GPIOx, MX_SPI3_MOSI_GPIO_Pin, MX_SPI3_MOSI_GPIO_AF, MX_SPI3_MOSI_GPIO_PuPd, MX_SPI3_MOSI_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI3_MISO_Pin
  static SPI_PIN SPI3_miso = {MX_SPI3_MISO_GPIOx, MX_SPI3_MISO_GPIO_Pin, MX_SPI3_MISO_GPIO_AF, MX_SPI3_MISO_GPIO_PuPd, MX_SPI3_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI3_SCK_Pin
  static SPI_PIN SPI3_sck  = {MX_SPI3_SCK_GPIOx,  MX_SPI3_SCK_GPIO_Pin,  MX_SPI3_SCK_GPIO_AF,  MX_SPI3_SCK_GPIO_PuPd,  MX_SPI3_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI3_NSS_Pin
  static SPI_PIN SPI3_nss  = {MX_SPI3_NSS_GPIOx,  MX_SPI3_NSS_GPIO_Pin,  MX_SPI3_NSS_GPIO_AF,  MX_SPI3_NSS_GPIO_PuPd,  MX_SPI3_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI3_RX_DMA_Instance
  static void SPI3_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi3_rx;
#else
  extern DMA_HandleTypeDef hdma_spi3_rx;
#endif
  static SPI_DMA SPI3_DMA_Rx = {
    &hdma_spi3_rx,
    SPI3_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI3_RX_DMA_Instance,
    MX_SPI3_RX_DMA_Channel,
    MX_SPI3_RX_DMA_Priority,
    MX_SPI3_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif 
#ifdef MX_SPI3_TX_DMA_Instance
  static void SPI3_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi3_tx;
#else
  extern DMA_HandleTypeDef hdma_spi3_tx;
#endif
  static SPI_DMA SPI3_DMA_Tx = {
    &hdma_spi3_tx,
    SPI3_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI3_TX_DMA_Instance,
    MX_SPI3_TX_DMA_Channel,
    MX_SPI3_TX_DMA_Priority,
    MX_SPI3_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// SPI3 Resources
static const SPI_RESOURCES SPI3_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi3,
#endif
  SPI3,
  HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_SPI3_MOSI_Pin
    &SPI3_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI3_MISO_Pin
    &SPI3_miso,
#else
    NULL,
#endif
#ifdef MX_SPI3_SCK_Pin
    &SPI3_sck,
#else
    NULL,
#endif
#ifdef MX_SPI3_NSS_Pin 
    &SPI3_nss,
#else
    NULL,
#endif
  },

  SPI3_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI3_RX_DMA_Instance
  &SPI3_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI3_TX_DMA_Instance
  &SPI3_DMA_Tx,
#else
  NULL,
#endif

  &SPI3_Info,
  &SPI3_TransferInfo
};
#endif /* MX_SPI3 */

#ifdef MX_SPI4

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi4;
#endif

// SPI4 Run-Time Information
static SPI_INFO          SPI4_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI4_TransferInfo;


#ifdef MX_SPI4_MOSI_Pin
  static SPI_PIN SPI4_mosi = {MX_SPI4_MOSI_GPIOx, MX_SPI4_MOSI_GPIO_Pin, MX_SPI4_MOSI_GPIO_AF, MX_SPI4_MOSI_GPIO_PuPd, MX_SPI4_MOSI_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI4_MISO_Pin
  static SPI_PIN SPI4_miso = {MX_SPI4_MISO_GPIOx, MX_SPI4_MISO_GPIO_Pin, MX_SPI4_MISO_GPIO_AF, MX_SPI4_MISO_GPIO_PuPd, MX_SPI4_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI4_SCK_Pin
  static SPI_PIN SPI4_sck  = {MX_SPI4_SCK_GPIOx,  MX_SPI4_SCK_GPIO_Pin,  MX_SPI4_SCK_GPIO_AF,  MX_SPI4_SCK_GPIO_PuPd,  MX_SPI4_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI4_NSS_Pin
  static SPI_PIN SPI4_nss  = {MX_SPI4_NSS_GPIOx,  MX_SPI4_NSS_GPIO_Pin,  MX_SPI4_NSS_GPIO_AF,  MX_SPI4_NSS_GPIO_PuPd,  MX_SPI4_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI4_RX_DMA_Instance
  static void SPI4_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi4_rx;
#else
  extern DMA_HandleTypeDef hdma_spi4_rx;
#endif
  static SPI_DMA SPI4_DMA_Rx = {
    &hdma_spi4_rx,
    SPI4_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI4_RX_DMA_Instance,
    MX_SPI4_RX_DMA_Channel,
    MX_SPI4_RX_DMA_Priority,
    MX_SPI4_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif 
#ifdef MX_SPI4_TX_DMA_Instance
  static void SPI4_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi4_tx;
#else
  extern DMA_HandleTypeDef hdma_spi4_tx;
#endif
  static SPI_DMA SPI4_DMA_Tx = {
    &hdma_spi4_tx,
    SPI4_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI4_TX_DMA_Instance,
    MX_SPI4_TX_DMA_Channel,
    MX_SPI4_TX_DMA_Priority,
    MX_SPI4_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

