Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
// SPI4 Resources
static const SPI_RESOURCES SPI4_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi4,
#endif
  SPI4,
  HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_SPI4_MOSI_Pin
    &SPI4_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI4_MISO_Pin
    &SPI4_miso,
#else
    NULL,
#endif
#ifdef MX_SPI4_SCK_Pin
    &SPI4_sck,
#else
    NULL,
#endif
#ifdef MX_SPI4_NSS_Pin 
    &SPI4_nss,
#else
    NULL,
#endif
  },

  SPI4_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI4_RX_DMA_Instance
  &SPI4_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI4_TX_DMA_Instance
  &SPI4_DMA_Tx,
#else
  NULL,
#endif

  &SPI4_Info,
  &SPI4_TransferInfo
};
#endif /* MX_SPI4 */

#ifdef MX_SPI5

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi5;
#endif

// SPI5 Run-Time Information
static SPI_INFO          SPI5_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI5_TransferInfo;


#ifdef MX_SPI5_MOSI_Pin
  static SPI_PIN SPI5_mosi = {MX_SPI5_MOSI_GPIOx, MX_SPI5_MOSI_GPIO_Pin, MX_SPI5_MOSI_GPIO_AF, MX_SPI5_MOSI_GPIO_PuPd, MX_SPI5_MOSI_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI5_MISO_Pin
  static SPI_PIN SPI5_miso = {MX_SPI5_MISO_GPIOx, MX_SPI5_MISO_GPIO_Pin, MX_SPI5_MISO_GPIO_AF, MX_SPI5_MISO_GPIO_PuPd, MX_SPI5_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI5_SCK_Pin
  static SPI_PIN SPI5_sck  = {MX_SPI5_SCK_GPIOx,  MX_SPI5_SCK_GPIO_Pin,  MX_SPI5_SCK_GPIO_AF,  MX_SPI5_SCK_GPIO_PuPd,  MX_SPI5_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI5_NSS_Pin
  static SPI_PIN SPI5_nss  = {MX_SPI5_NSS_GPIOx,  MX_SPI5_NSS_GPIO_Pin,  MX_SPI5_NSS_GPIO_AF,  MX_SPI5_NSS_GPIO_PuPd,  MX_SPI5_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI5_RX_DMA_Instance
  static void SPI5_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi5_rx;
#else
  extern DMA_HandleTypeDef hdma_spi5_rx;
#endif
  static SPI_DMA SPI5_DMA_Rx = {
    &hdma_spi5_rx,
    SPI5_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI5_RX_DMA_Instance,
    MX_SPI5_RX_DMA_Channel,
    MX_SPI5_RX_DMA_Priority,
    MX_SPI5_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif 
#ifdef MX_SPI5_TX_DMA_Instance
  static void SPI5_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi5_tx;
#else
  extern DMA_HandleTypeDef hdma_spi5_tx;
#endif
  static SPI_DMA SPI5_DMA_Tx = {
    &hdma_spi5_tx,
    SPI5_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI5_TX_DMA_Instance,
    MX_SPI5_TX_DMA_Channel,
    MX_SPI5_TX_DMA_Priority,
    MX_SPI5_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// SPI5 Resources
static const SPI_RESOURCES SPI5_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi5,
#endif
  SPI5,
  HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_SPI5_MOSI_Pin
    &SPI5_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI5_MISO_Pin
    &SPI5_miso,
#else
    NULL,
#endif
#ifdef MX_SPI5_SCK_Pin
    &SPI5_sck,
#else
    NULL,
#endif
#ifdef MX_SPI5_NSS_Pin 
    &SPI5_nss,
#else
    NULL,
#endif
  },

  SPI5_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI5_RX_DMA_Instance
  &SPI5_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI5_TX_DMA_Instance
  &SPI5_DMA_Tx,
#else
  NULL,
#endif

  &SPI5_Info,
  &SPI5_TransferInfo
};
#endif /* MX_SPI5 */

#ifdef MX_SPI6

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
extern SPI_HandleTypeDef hspi6;
#endif

// SPI6 Run-Time Information
static SPI_INFO          SPI6_Info = { 0U, { 0U, 0U, 0U, 0U}, 0U, 0U };
static SPI_TRANSFER_INFO SPI6_TransferInfo;


#ifdef MX_SPI6_MOSI_Pin
  static SPI_PIN SPI6_mosi = {MX_SPI6_MOSI_GPIOx, MX_SPI6_MOSI_GPIO_Pin, MX_SPI6_MOSI_GPIO_AF, MX_SPI6_MOSI_GPIO_PuPd, MX_SPI6_MOSI_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI6_MISO_Pin
  static SPI_PIN SPI6_miso = {MX_SPI6_MISO_GPIOx, MX_SPI6_MISO_GPIO_Pin, MX_SPI6_MISO_GPIO_AF, MX_SPI6_MISO_GPIO_PuPd, MX_SPI6_MISO_GPIO_Speed, 0U};
#endif
#ifdef MX_SPI6_SCK_Pin
  static SPI_PIN SPI6_sck  = {MX_SPI6_SCK_GPIOx,  MX_SPI6_SCK_GPIO_Pin,  MX_SPI6_SCK_GPIO_AF,  MX_SPI6_SCK_GPIO_PuPd,  MX_SPI6_SCK_GPIO_Speed,  0U};
#endif
#ifdef MX_SPI6_NSS_Pin
  static SPI_PIN SPI6_nss  = {MX_SPI6_NSS_GPIOx,  MX_SPI6_NSS_GPIO_Pin,  MX_SPI6_NSS_GPIO_AF,  MX_SPI6_NSS_GPIO_PuPd,  MX_SPI6_NSS_GPIO_Speed,  0U};
#endif

#ifdef MX_SPI6_RX_DMA_Instance
  static void SPI6_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi6_rx;
#else
  extern DMA_HandleTypeDef hdma_spi6_rx;
#endif
  static SPI_DMA SPI6_DMA_Rx = {
    &hdma_spi6_rx,
    SPI6_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI6_RX_DMA_Instance,
    MX_SPI6_RX_DMA_Channel,
    MX_SPI6_RX_DMA_Priority,
    MX_SPI6_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_SPI6_TX_DMA_Instance
  static void SPI6_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_spi6_tx;
#else
  extern DMA_HandleTypeDef hdma_spi6_tx;
#endif
  static SPI_DMA SPI6_DMA_Tx = {
    &hdma_spi6_tx,
    SPI6_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_SPI6_TX_DMA_Instance,
    MX_SPI6_TX_DMA_Channel,
    MX_SPI6_TX_DMA_Priority,
    MX_SPI6_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// SPI6 Resources
static const SPI_RESOURCES SPI6_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  &hspi6,
#endif
  SPI6,
  HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_SPI6_MOSI_Pin
    &SPI6_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI6_MISO_Pin
    &SPI6_miso,
#else
    NULL,
#endif
#ifdef MX_SPI6_SCK_Pin
    &SPI6_sck,
#else
    NULL,
#endif
#ifdef MX_SPI6_NSS_Pin 
    &SPI6_nss,
#else
    NULL,
#endif
  },

  SPI6_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_SPI6_RX_DMA_Instance
  &SPI6_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI6_TX_DMA_Instance
  &SPI6_DMA_Tx,
#else
  NULL,
#endif

  &SPI6_Info,
  &SPI6_TransferInfo
};
#endif /* MX_SPI6 */

// Macros
#ifdef __SPI_DMA
#define DMA1_CLK_ENABLE()               __HAL_RCC_DMA1_CLK_ENABLE()
#define DMA2_CLK_ENABLE()               __HAL_RCC_DMA2_CLK_ENABLE()
#endif

// Function prototypes
static uint32_t SPI_RxData (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer);
static uint32_t SPI_TxData (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer);
static void SPI_IRQHandler (const SPI_RESOURCES *spi);
#ifdef __SPI_DMA_TX
static void SPI_TX_DMA_Complete(const SPI_RESOURCES *spi);
#endif
#ifdef __SPI_DMA_RX
static void SPI_RX_DMA_Complete(const SPI_RESOURCES *spi);
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
/**
  \fn          void Enable_GPIO_Clock (const GPIO_TypeDef *port)
  \brief       Enable GPIO clock
*/
static void Enable_GPIO_Clock (const GPIO_TypeDef *GPIOx) {
  if      (GPIOx == GPIOA) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
  else if (GPIOx == GPIOB) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
  else if (GPIOx == GPIOC) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
#if defined(GPIOD)
  else if (GPIOx == GPIOD) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
#endif
#if defined(GPIOE)
  else if (GPIOx == GPIOE) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
#endif
#if defined(GPIOF)
  else if (GPIOx == GPIOF) { __HAL_RCC_GPIOF_CLK_ENABLE(); }
#endif
#if defined(GPIOG)
  else if (GPIOx == GPIOG) { __HAL_RCC_GPIOG_CLK_ENABLE(); }
#endif
#if defined(GPIOH)
  else if (GPIOx == GPIOH) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
#endif
#if defined(GPIOI)
  else if (GPIOx == GPIOI) { __HAL_RCC_GPIOI_CLK_ENABLE(); }
#endif
#if defined(GPIOJ)
  else if (GPIOx == GPIOJ) { __HAL_RCC_GPIOJ_CLK_ENABLE(); }
#endif
#if defined(GPIOK)
  else if (GPIOx == GPIOK) { __HAL_RCC_GPIOK_CLK_ENABLE(); }
#endif
}

/**
  \fn          void Enable_SPI_Clock (const SPI_TypeDef *spi)
  \brief       Enable SPI clock
*/
static void Enable_SPI_Clock (const SPI_TypeDef *spi) {
  if      (spi == SPI1) { __HAL_RCC_SPI1_CLK_ENABLE(); }
#ifdef SPI2
  else if (spi == SPI2) { __HAL_RCC_SPI2_CLK_ENABLE(); }
#endif
#ifdef SPI3
  else if (spi == SPI3) { __HAL_RCC_SPI3_CLK_ENABLE(); }
#endif
#ifdef SPI4
  else if (spi == SPI4) { __HAL_RCC_SPI4_CLK_ENABLE(); }
#endif
#ifdef SPI5
  else if (spi == SPI5) { __HAL_RCC_SPI5_CLK_ENABLE(); }
#endif
#ifdef SPI6
  else if (spi == SPI6) { __HAL_RCC_SPI6_CLK_ENABLE(); }
#endif
}

/**
  \fn          void Disable_SPI_Clock (const SPI_TypeDef *spi)
  \brief       Disable SPI clock
*/
static void Disable_SPI_Clock (const SPI_TypeDef *spi) {
  if      (spi == SPI1) { __HAL_RCC_SPI1_CLK_DISABLE(); }
#ifdef SPI2
  else if (spi == SPI2) { __HAL_RCC_SPI2_CLK_DISABLE(); }
#endif
#ifdef SPI3
  else if (spi == SPI3) { __HAL_RCC_SPI3_CLK_DISABLE(); }
#endif
#ifdef SPI4
  else if (spi == SPI4) { __HAL_RCC_SPI4_CLK_DISABLE(); }
#endif
#ifdef SPI5
  else if (spi == SPI5) { __HAL_RCC_SPI5_CLK_DISABLE(); }
#endif
#ifdef SPI6
  else if (spi == SPI6) { __HAL_RCC_SPI6_CLK_DISABLE(); }
#endif
}
#endif


/**
  \fn          void SPI_PeripheralReset (const SPI_TypeDef *spi)
  \brief       SPI Reset
*/
static void SPI_PeripheralReset (const SPI_TypeDef *spi) {

  if      (spi == SPI1) { __HAL_RCC_SPI1_FORCE_RESET(); }
#ifdef SPI2
  else if (spi == SPI2) { __HAL_RCC_SPI2_FORCE_RESET(); }
#endif
#ifdef SPI3
  else if (spi == SPI3) { __HAL_RCC_SPI3_FORCE_RESET(); }
#endif
#ifdef SPI4
  else if (spi == SPI4) { __HAL_RCC_SPI4_FORCE_RESET(); }
#endif
#ifdef SPI5
  else if (spi == SPI5) { __HAL_RCC_SPI5_FORCE_RESET(); }
#endif
#ifdef SPI6
  else if (spi == SPI6) { __HAL_RCC_SPI6_FORCE_RESET(); }
#endif

  __NOP(); __NOP(); __NOP(); __NOP();

  if      (spi == SPI1) { __HAL_RCC_SPI1_RELEASE_RESET(); }
#ifdef SPI2
  else if (spi == SPI2) { __HAL_RCC_SPI2_RELEASE_RESET(); }
#endif
#ifdef SPI3
  else if (spi == SPI3) { __HAL_RCC_SPI3_RELEASE_RESET(); }
#endif
#ifdef SPI4
  else if (spi == SPI4) { __HAL_RCC_SPI4_RELEASE_RESET(); }
#endif
#ifdef SPI5
  else if (spi == SPI5) { __HAL_RCC_SPI5_RELEASE_RESET(); }
#endif
#ifdef SPI6
  else if (spi == SPI6) { __HAL_RCC_SPI6_RELEASE_RESET(); }
#endif
}

/**
  \fn          ARM_DRIVER_VERSION SPIX_GetVersion (void)
  \brief       Get SPI driver version.
  \return      \ref ARM_DRV_VERSION
*/
static ARM_DRIVER_VERSION SPIX_GetVersion (void) {
  return DriverVersion;
}


/**
  \fn          ARM_SPI_CAPABILITIES SPI_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_SPI_CAPABILITIES
*/
static ARM_SPI_CAPABILITIES SPIX_GetCapabilities (void) {
  return DriverCapabilities;
}


/**
  \fn          int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi)
  \brief       Initialize SPI Interface.
  \param[in]   cb_event  Pointer to \ref ARM_SPI_SignalEvent
  \param[in]   spi       Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi) {
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  GPIO_InitTypeDef GPIO_InitStruct;
#endif

  if (spi->info->state & SPI_INITIALIZED) { return ARM_DRIVER_OK; }

  // Initialize SPI Run-Time Resources
  spi->info->cb_event = cb_event;
  spi->info->status.busy       = 0U;
  spi->info->status.data_lost  = 0U;
  spi->info->status.mode_fault = 0U;

  // Clear transfer information
  memset((void *)spi->xfer, 0, sizeof(SPI_TRANSFER_INFO));
  
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  if (spi->io.sck) {
    // Configure SPI SCK pin
    Enable_GPIO_Clock (spi->io.sck->port);
    GPIO_InitStruct.Pin       = spi->io.sck->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = spi->io.sck->pupd;
    GPIO_InitStruct.Speed     = spi->io.sck->speed;
    GPIO_InitStruct.Alternate = spi->io.sck->af;
    HAL_GPIO_Init(spi->io.sck->port, &GPIO_InitStruct);
  }

  if (spi->io.mosi) {
    // Configure SPI MOSI pin
    Enable_GPIO_Clock (spi->io.mosi->port);
    GPIO_InitStruct.Pin       = spi->io.mosi->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = spi->io.mosi->pupd;
    GPIO_InitStruct.Speed     = spi->io.mosi->speed;
    GPIO_InitStruct.Alternate = spi->io.mosi->af;
    HAL_GPIO_Init(spi->io.mosi->port, &GPIO_InitStruct);
  }

  if (spi->io.miso) {
    // Configure SPI MISO pin
    Enable_GPIO_Clock (spi->io.miso->port);
    GPIO_InitStruct.Pin       = spi->io.miso->pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = spi->io.miso->pupd;
    GPIO_InitStruct.Speed     = spi->io.miso->speed;
    GPIO_InitStruct.Alternate = spi->io.miso->af;
    HAL_GPIO_Init(spi->io.miso->port, &GPIO_InitStruct);
  }

