Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
#ifdef __SPI_DMA
  if ((spi->rx_dma != NULL) || (spi->tx_dma != NULL)) {

    if (spi->rx_dma != NULL) {
      // Initialize SPI RX DMA Resources
      memset((void *)spi->rx_dma->hdma, 0U, sizeof(DMA_HandleTypeDef));
      spi->rx_dma->hdma->Instance             = spi->rx_dma->stream;
      spi->rx_dma->hdma->Init.Channel         = spi->rx_dma->channel;
      spi->rx_dma->hdma->Init.Direction       = DMA_PERIPH_TO_MEMORY;
      spi->rx_dma->hdma->Init.Mode            = DMA_NORMAL;
      spi->rx_dma->hdma->Init.Priority        = spi->rx_dma->priority;
      spi->rx_dma->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
      spi->rx_dma->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
      spi->rx_dma->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
      spi->rx_dma->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
      spi->rx_dma->hdma->Parent               = NULL;
      spi->rx_dma->hdma->XferCpltCallback     = spi->rx_dma->cb_complete;
      spi->rx_dma->hdma->XferHalfCpltCallback = NULL;
      spi->rx_dma->hdma->XferM1CpltCallback   = NULL;
      spi->rx_dma->hdma->XferErrorCallback    = NULL;
    }

    if (spi->tx_dma != NULL) {
      // Initialize SPI TX DMA Resources
      memset((void *)spi->tx_dma->hdma, 0U, sizeof(DMA_HandleTypeDef));
      spi->tx_dma->hdma->Instance             = spi->tx_dma->stream;
      spi->tx_dma->hdma->Init.Channel         = spi->tx_dma->channel;
      spi->tx_dma->hdma->Init.Direction       = DMA_MEMORY_TO_PERIPH;
      spi->tx_dma->hdma->Init.Mode            = DMA_NORMAL;
      spi->tx_dma->hdma->Init.Priority        = spi->tx_dma->priority;
      spi->tx_dma->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
      spi->tx_dma->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
      spi->tx_dma->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
      spi->tx_dma->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
      spi->tx_dma->hdma->Parent               = NULL;
      spi->tx_dma->hdma->XferCpltCallback     = spi->tx_dma->cb_complete;
      spi->tx_dma->hdma->XferHalfCpltCallback = NULL;
      spi->tx_dma->hdma->XferM1CpltCallback   = NULL;
      spi->tx_dma->hdma->XferErrorCallback    = NULL;
    }

    // Enable DMA clock
    if ((spi->reg == SPI2) || (spi->reg == SPI3)) {
      // DMA1 used for SPI2 and SPI3
      DMA1_CLK_ENABLE();
    } else {
      // DMA2 used for SPI1, SPI4, SPI5 and SPI6
      DMA2_CLK_ENABLE();
    }
  }
#endif
#else
  spi->h->Instance = spi->reg;

  if (spi->rx_dma != NULL) {
    spi->rx_dma->hdma->XferCpltCallback = spi->rx_dma->cb_complete;
  }
  if (spi->tx_dma != NULL) {
    spi->tx_dma->hdma->XferCpltCallback = spi->tx_dma->cb_complete;
  }
#endif

  spi->info->state = SPI_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Uninitialize (const SPI_RESOURCES *spi)
  \brief       De-initialize SPI Interface.
  \param[in]   spi  Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Uninitialize (const SPI_RESOURCES *spi) {

  if ((spi->info->state & SPI_POWERED) != 0U) {
    // If peripheral is powered, power off the peripheral
    (void)SPI_PowerControl(ARM_POWER_OFF, spi);
  }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  // Unconfigure SPI pins
  if (spi->io.mosi != NULL) { HAL_GPIO_DeInit(spi->io.mosi->port, spi->io.mosi->pin); }
  if (spi->io.miso != NULL) { HAL_GPIO_DeInit(spi->io.miso->port, spi->io.miso->pin); }
  if (spi->io.sck  != NULL) { HAL_GPIO_DeInit(spi->io.sck->port,  spi->io.sck->pin);  }
  if (spi->io.nss  != NULL) { HAL_GPIO_DeInit(spi->io.nss->port,  spi->io.nss->pin);  }

  if (spi->rx_dma != NULL)  { spi->rx_dma->hdma->Instance = NULL; }
  if (spi->tx_dma != NULL)  { spi->tx_dma->hdma->Instance = NULL; }
#else
  spi->h->Instance = NULL;
#endif

  // Clear SPI state
  spi->info->state = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_PowerControl (ARM_POWER_STATE state, const SPI_RESOURCES *spi)
  \brief       Control SPI Interface Power.
  \param[in]   state  Power state
  \param[in]   spi    Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_PowerControl (ARM_POWER_STATE state, const SPI_RESOURCES *spi) {

  if ((spi->info->state & SPI_INITIALIZED) == 0U) {
    return ARM_DRIVER_ERROR;
  }

  if ((state != ARM_POWER_OFF)  && 
      (state != ARM_POWER_FULL) && 
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  switch (state) {
    case ARM_POWER_OFF:
      if (spi->info->status.busy != 0U) {
        // If operation is in progress, abort it
        (void)SPI_Control(ARM_SPI_ABORT_TRANSFER, 0U, spi);
      }

      // SPI peripheral reset
      SPI_PeripheralReset (spi->reg);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      HAL_NVIC_DisableIRQ ((IRQn_Type)spi->irq_num);
#ifdef __SPI_DMA
      if (spi->rx_dma != NULL) {
        if (spi->rx_dma->hdma->Instance != NULL) {
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ ((IRQn_Type)spi->rx_dma->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (spi->rx_dma->hdma);
        }
      }

      if (spi->tx_dma != NULL) {
        if (spi->tx_dma->hdma->Instance != NULL) {
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ ((IRQn_Type)spi->tx_dma->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (spi->tx_dma->hdma);
        }
      }
#endif
#else
      if (spi->h->Instance != NULL) {
        HAL_SPI_MspDeInit (spi->h);
      }
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Disable SPI clock
      Disable_SPI_Clock (spi->reg);
#endif

      // Clear status flags
      spi->info->status.busy       = 0U;
      spi->info->status.data_lost  = 0U;
      spi->info->status.mode_fault = 0U;

      // Clear powered flag
      spi->info->state &= ~((uint32_t)SPI_POWERED);
      break;

    case ARM_POWER_FULL:
      if ((spi->info->state & SPI_POWERED)     != 0U) {
        return ARM_DRIVER_OK;
      }

      // Clear status flags
      spi->info->status.busy       = 0U;
      spi->info->status.data_lost  = 0U;
      spi->info->status.mode_fault = 0U;

