Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
      spi->xfer->def_val           = 0U;

      // Ready for operation - set powered flag
      spi->info->state |= SPI_POWERED;

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Enable SPI clock
      Enable_SPI_Clock (spi->reg);

      // Clear and Enable SPI IRQ
      NVIC_ClearPendingIRQ((IRQn_Type)spi->irq_num);
      NVIC_EnableIRQ((IRQn_Type)spi->irq_num);

#ifdef __SPI_DMA
      if (spi->rx_dma) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ((IRQn_Type)spi->rx_dma->irq_num);
        NVIC_EnableIRQ((IRQn_Type)spi->rx_dma->irq_num);
      }

      if (spi->tx_dma) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ((IRQn_Type)spi->tx_dma->irq_num);
        NVIC_EnableIRQ((IRQn_Type)spi->tx_dma->irq_num);
      }
#endif
#else
      HAL_SPI_MspInit (spi->h);
#endif

      // SPI peripheral reset
      SPI_PeripheralReset (spi->reg);
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Send (const void *data, uint32_t num, const SPI_RESOURCES *spi)
  \brief       Start sending data to SPI transmitter.
  \param[in]   data  Pointer to buffer with data to send to SPI transmitter
  \param[in]   num   Number of data items to send
  \param[in]   spi   Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Send (const void *data, uint32_t num, const SPI_RESOURCES *spi) {

  if ((data == NULL) || (num == 0U))             { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((spi->info->state & SPI_CONFIGURED) == 0U) { return ARM_DRIVER_ERROR; }
  if ( spi->info->status.busy)                   { return ARM_DRIVER_ERROR_BUSY; }

  // Check if transmit pin available
  if ((((spi->io.mosi != NULL) && ((spi->info->mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)) ||
       ((spi->io.miso != NULL) && ((spi->info->mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE ))) == 0U) {
    return ARM_DRIVER_ERROR;
  }

  // Update SPI statuses
  spi->info->status.busy       = 1U;
  spi->info->status.data_lost  = 0U;
  spi->info->status.mode_fault = 0U;

  // Save transfer info
  spi->xfer->rx_buf = NULL;
  spi->xfer->tx_buf = (uint8_t *)((uint32_t)data);
  spi->xfer->num    = num;
  spi->xfer->rx_cnt = 0U;
  spi->xfer->tx_cnt = 0U;

#ifdef __SPI_DMA_RX
  if (spi->rx_dma != NULL) {
    // DMA mode
    // Prepare DMA to receive dummy RX data
    spi->rx_dma->hdma->Init.PeriphInc             = DMA_PINC_DISABLE;
    spi->rx_dma->hdma->Init.MemInc                = DMA_MINC_DISABLE;
    if (spi->reg->CR1 & SPI_CR1_DFF) {
      // 16 - bit data frame
      spi->rx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      spi->rx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    } else {
      //  8 - bit data frame
      spi->rx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      spi->rx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    }
    // Initialize and start SPI RX DMA Stream
    if (HAL_DMA_Init     (spi->rx_dma->hdma) != HAL_OK) { return ARM_DRIVER_ERROR; }
    if (HAL_DMA_Start_IT (spi->rx_dma->hdma, (uint32_t)(&spi->reg->DR), (uint32_t)(&spi->xfer->dump_val), num) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    // RX Buffer DMA enable
    spi->reg->CR2 |= SPI_CR2_RXDMAEN;
  }
#endif

#ifdef __SPI_DMA_TX
  if (spi->tx_dma != NULL) {
    // Prepare DMA to send TX data
    spi->tx_dma->hdma->Init.PeriphInc             = DMA_PINC_DISABLE;
    spi->tx_dma->hdma->Init.MemInc                = DMA_MINC_ENABLE; 
    if (spi->reg->CR1 & SPI_CR1_DFF) {
      // 16 - bit data frame
      spi->tx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      spi->tx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    } else {
      //  8 - bit data frame
      spi->tx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      spi->tx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    }

    // Initialize and start SPI TX DMA Stream
    if (HAL_DMA_Init     (spi->tx_dma->hdma) != HAL_OK) { return ARM_DRIVER_ERROR; }
    if (HAL_DMA_Start_IT (spi->tx_dma->hdma, (uint32_t)spi->xfer->tx_buf, (uint32_t)(&spi->reg->DR), num) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    // TX Buffer DMA enable
    spi->reg->CR2 |= SPI_CR2_TXDMAEN;
  } else
#endif
  {
    // Interrupt mode
    SPI_TxData (spi->reg, spi->xfer);
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Receive (void *data, uint32_t num, const SPI_RESOURCES *spi)
  \brief       Start receiving data from SPI receiver.
  \param[out]  data  Pointer to buffer for data to receive from SPI receiver
  \param[in]   num   Number of data items to receive
  \param[in]   spi   Pointer to SPI resources
  \return      \ref execution_status
*/
static int32_t SPI_Receive (void *data, uint32_t num, const SPI_RESOURCES *spi) {

  if ((data == NULL) || (num == 0U))             { return ARM_DRIVER_ERROR_PARAMETER; }
  if ((spi->info->state & SPI_CONFIGURED) == 0U) { return ARM_DRIVER_ERROR; }
  if ( spi->info->status.busy)                   { return ARM_DRIVER_ERROR_BUSY; }

  // Check if receive pin available
  if ((((spi->io.miso != NULL) && ((spi->info->mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)) ||
       ((spi->io.mosi != NULL) && ((spi->info->mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE ))) == 0U) {
    return ARM_DRIVER_ERROR;
  }

  // Update SPI statuses
  spi->info->status.busy       = 1U;
  spi->info->status.data_lost  = 0U;
  spi->info->status.mode_fault = 0U;

  // Save transfer info
  spi->xfer->rx_buf = (uint8_t *)data;
  spi->xfer->tx_buf = NULL;
  spi->xfer->num    = num;
  spi->xfer->rx_cnt = 0U;
  spi->xfer->tx_cnt = 0U;

#ifdef __SPI_DMA_RX
  // DMA mode
  if (spi->rx_dma != NULL) {
    // Prepare DMA to receive RX data
    spi->rx_dma->hdma->Init.PeriphInc             = DMA_PINC_DISABLE;
    spi->rx_dma->hdma->Init.MemInc                = DMA_MINC_ENABLE; 
    if (spi->reg->CR1 & SPI_CR1_DFF) {
      // 16 - bit data frame
      spi->rx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      spi->rx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    } else {
      //  8 - bit data frame
      spi->rx_dma->hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      spi->rx_dma->hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    }
    // Initialize and start SPI RX DMA Stream
    if (HAL_DMA_Init     (spi->rx_dma->hdma) != HAL_OK) { return ARM_DRIVER_ERROR; }
    if (HAL_DMA_Start_IT (spi->rx_dma->hdma, (uint32_t)(&spi->reg->DR), (uint32_t)spi->xfer->rx_buf, num) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

