Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
          // Software slave management
          cr1 |= SPI_CR1_SSM | SPI_CR1_SSI;

          mode |= ARM_SPI_SS_MASTER_SW;
        } else {
          // NSS pin is not available
          return ARM_SPI_ERROR_SS_MODE;
        }
        break;

      case ARM_SPI_SS_MASTER_HW_OUTPUT:
        if (spi->io.nss) {
          // Configure NSS pin - SPI NSS alternative function
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
          Enable_GPIO_Clock (spi->io.nss->port);
#endif
          GPIO_InitStruct.Pin       = spi->io.nss->pin;
          GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
          GPIO_InitStruct.Pull      = spi->io.nss->pupd;
          GPIO_InitStruct.Speed     = spi->io.nss->speed;
          GPIO_InitStruct.Alternate = spi->io.nss->af;
          HAL_GPIO_Init(spi->io.nss->port, &GPIO_InitStruct);

          // Slave select output enable
          cr2 |= SPI_CR2_SSOE;

          mode |= ARM_SPI_SS_MASTER_HW_OUTPUT;
        } else {
          // NSS pin is not available
          return ARM_SPI_ERROR_SS_MODE;
        }
        break;
        default: return ARM_SPI_ERROR_SS_MODE;
    }
  }

  // Slave select slave modes
  if (mode ==  ARM_SPI_MODE_SLAVE) {
    switch (control & ARM_SPI_SS_SLAVE_MODE_Msk) {
      case ARM_SPI_SS_SLAVE_HW:
        if (spi->io.nss) {
          // Configure NSS pin - SPI NSS alternative function
          GPIO_InitStruct.Pin       = spi->io.nss->pin;
          GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
          GPIO_InitStruct.Pull      = spi->io.nss->pupd;
          GPIO_InitStruct.Speed     = spi->io.nss->speed;
          GPIO_InitStruct.Alternate = spi->io.nss->af;
          HAL_GPIO_Init(spi->io.nss->port, &GPIO_InitStruct);

          mode |= ARM_SPI_SS_SLAVE_HW;
        } else {
          // NSS pin is not available
          return ARM_SPI_ERROR_SS_MODE;
        }
        break;

      case ARM_SPI_SS_SLAVE_SW:
        if (spi->io.nss) {
          // Unconfigure NSS pin
          HAL_GPIO_DeInit (spi->io.nss->port, spi->io.nss->pin);
        }
        // Enable software slave management
        cr1 |= SPI_CR1_SSM;
        mode |= ARM_SPI_SS_SLAVE_SW;
        break;
      default: return ARM_SPI_ERROR_SS_MODE;
    }
  }

  // Set SPI Bus Speed, only for master mode
  if ((mode & ARM_SPI_MODE_MASTER) != 0U) {
    pclk = spi->periph_clock();
    for (val = 0U; val < 8U; val++) {
      if (arg >= (pclk >> (val + 1U))) break;
    }
    if ((val == 8U) || (arg < (pclk >> (val + 1U)))) {
      // Requested Bus Speed can not be configured
      return ARM_DRIVER_ERROR;
    }
    // Save prescaler value
    cr1 |= (val << 3U);
  }

  spi->info->mode = mode;

  // Configure registers
  spi->reg->CR1 &= ~SPI_CR1_SPE;

  if ((spi->rx_dma == NULL) && (spi->tx_dma == NULL)) {
    // Enable RX buffer Not Empty interrupt
    cr2 |= SPI_CR2_RXNEIE;
  }

  spi->reg->CR2  = cr2 | SPI_CR2_ERRIE;
  spi->reg->CR1  = cr1;

  if ((mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_INACTIVE) {
    spi->info->state &= ~((uint32_t)SPI_CONFIGURED);
  } else {
    spi->info->state |=  SPI_CONFIGURED;
  }

  // Enable SPI
  spi->reg->CR1 |= SPI_CR1_SPE;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi)
  \brief       Get SPI status.
  \param[in]   spi  Pointer to SPI resources
  \return      SPI status \ref ARM_SPI_STATUS
*/
static ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi) {
  ARM_SPI_STATUS status;

  status.busy       = spi->info->status.busy;
  status.data_lost  = spi->info->status.data_lost;
  status.mode_fault = spi->info->status.mode_fault;

  return status;
}

// SPI Tx Data function
static uint32_t SPI_TxData (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer) {
  uint32_t event;
  uint16_t data_16bit;
  uint8_t  data_8bit;

  if (xfer->tx_cnt < xfer->num) {
    if ((reg->CR1 & SPI_CR1_DFF) == 0U) {
      if (xfer->tx_buf != NULL) {
        data_8bit = *(xfer->tx_buf++);
      } else {
        data_8bit = (uint8_t)xfer->def_val;
      }

      // Write data to data register
      *(volatile uint8_t *)(&reg->DR) = data_8bit;
    } else {
      if (xfer->tx_buf != NULL) {
        data_16bit  = *(xfer->tx_buf++);
        data_16bit |= *(xfer->tx_buf++) << 8U;
      } else {
        data_16bit  = (uint16_t)xfer->def_val;
      }

      // Write data to data register
      *(volatile uint16_t *)(&reg->DR) = data_16bit;
    }

    xfer->tx_cnt++;

    event = 0U;
  }
  else {
    // Unexpected transfer, data lost
    event = ARM_SPI_EVENT_DATA_LOST;
  }
  
  return (event);
}

// SPI Rx Data function
static uint32_t SPI_RxData (SPI_TypeDef *reg, SPI_TRANSFER_INFO *xfer) {
  uint32_t event;
  uint16_t data_16bit;
  uint8_t  data_8bit;

  if (xfer->rx_cnt < xfer->num) {
    if ((reg->CR1 & SPI_CR1_DFF) == 0U) {
      // 8-bit data frame
      data_8bit = *(volatile uint8_t *)(&reg->DR);
      if (xfer->rx_buf != NULL) {
        *(xfer->rx_buf++) = data_8bit;
      }
    } else {
      // 16-bit data frame
      data_16bit = *(volatile uint16_t *)(&reg->DR);
      if (xfer->rx_buf != NULL) {
        *(xfer->rx_buf++) = (uint8_t) data_16bit;
        *(xfer->rx_buf++) = (uint8_t)(data_16bit >> 8U);
      }
    }

    xfer->rx_cnt++;

    if (xfer->rx_cnt == xfer->num) {
      // Transfer completed
      event = ARM_SPI_EVENT_TRANSFER_COMPLETE;
    }
    else {
      event = 0U;
    }
  }
  else {
    // Unexpected transfer, data lost
    event = ARM_SPI_EVENT_DATA_LOST;
  }

  return (event);
}

/*SPI IRQ Handler */
void SPI_IRQHandler (const SPI_RESOURCES *spi) {
  uint8_t  data_8bit;
  uint16_t data_16bit;
  uint32_t event, sr;

  event = 0U;

  // Save status register
  sr = spi->reg->SR;

  if ((sr & (SPI_SR_OVR | SPI_SR_UDR | SPI_SR_MODF)) != 0U) {
    if ((sr & SPI_SR_OVR) != 0U) {
      // Clear Overrun flag by reading data and status register
      if ((spi->reg->CR1 & SPI_CR1_DFF) == 0U) {
        // 8-bit data frame
        data_8bit = *(volatile uint8_t *)(&spi->reg->DR);
        if (spi->xfer->rx_cnt < spi->xfer->num) {
          if (spi->xfer->rx_buf != NULL) {
            *(spi->xfer->rx_buf++) = data_8bit;
          }
        }
      } else {
        // 16-bit data frame
        data_16bit = *(volatile uint16_t *)(&spi->reg->DR);
        if (spi->xfer->rx_cnt < spi->xfer->num) {
          if (spi->xfer->rx_buf != NULL) {
            *(spi->xfer->rx_buf++) = (uint8_t) data_16bit;
            *(spi->xfer->rx_buf++) = (uint8_t)(data_16bit >> 8U);
          }
        }
      }
      spi->xfer->rx_cnt++;
      sr = spi->reg->SR;

      spi->info->status.data_lost = 1U;
      event |=ARM_SPI_EVENT_DATA_LOST;
    }

    if ((sr & SPI_SR_UDR) != 0U) {
      // Underrun flag is set
      spi->info->status.data_lost = 1U;
      event |= ARM_SPI_EVENT_DATA_LOST;
    }

    if ((sr & SPI_SR_MODF) != 0U) {
      // Mode fault flag is set
      spi->info->status.mode_fault = 1U;

      // Write CR1 register to clear MODF flag
      spi->reg->CR1 = spi->reg->CR1;
      event |= ARM_SPI_EVENT_MODE_FAULT;
    }
  }
  else {
    if (((sr & SPI_SR_RXNE) != 0U) && ((spi->reg->CR2 & SPI_CR2_RXNEIE) != 0U)) {
      // RX buffer Not Empty
      event = SPI_RxData (spi->reg, spi->xfer);
      
      if (event == 0U) {
        event = SPI_TxData (spi->reg, spi->xfer);
      }
      else {
        if (event == ARM_SPI_EVENT_TRANSFER_COMPLETE) {
          spi->info->status.busy = 0U;
        }
      }
    }
  }

  // Send event
  if ((event != 0U) && ((spi->info->cb_event != NULL))) {
    spi->info->cb_event(event);
  }
}

