Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
#ifdef __SPI_DMA_TX
static void SPI_TX_DMA_Complete(const SPI_RESOURCES *spi) {

  if ((__HAL_DMA_GET_COUNTER(spi->tx_dma->hdma) != 0) && (spi->xfer->num != 0)) {
    // TX DMA Complete caused by transfer abort
    return;
  }

  spi->xfer->tx_cnt = spi->xfer->num;
}
#endif

#ifdef __SPI_DMA_RX
static void SPI_RX_DMA_Complete(const SPI_RESOURCES *spi) {

  if ((__HAL_DMA_GET_COUNTER(spi->rx_dma->hdma) != 0) && (spi->xfer->num != 0)) {
    // RX DMA Complete caused by transfer abort
    return;
  }

  spi->xfer->rx_cnt = spi->xfer->num;

  spi->info->status.busy = 0U;
  if (spi->info->cb_event != NULL) {
    spi->info->cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
  }
}
#endif

// SPI1
#ifdef MX_SPI1
static int32_t        SPI1_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI1_Resources); }
static int32_t        SPI1_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI1_Resources); }
static int32_t        SPI1_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI1_Resources); }
static int32_t        SPI1_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI1_Resources); }
static int32_t        SPI1_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI1_Resources); }
static int32_t        SPI1_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI1_Resources); }
static uint32_t       SPI1_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI1_Resources); }
static int32_t        SPI1_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI1_Resources); }
static ARM_SPI_STATUS SPI1_GetStatus           (void)                                              { return SPI_GetStatus (&SPI1_Resources); }
       void           SPI1_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI1_Resources); }

#ifdef MX_SPI1_TX_DMA_Instance
static void           SPI1_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI1_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI1_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI1_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi1_tx);
}
#endif
#endif
#ifdef MX_SPI1_RX_DMA_Instance
static void           SPI1_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI1_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI1_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI1_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi1_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI1 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI1_Initialize,
  SPI1_Uninitialize,
  SPI1_PowerControl,
  SPI1_Send,
  SPI1_Receive,
  SPI1_Transfer,
  SPI1_GetDataCount,
  SPI1_Control,
  SPI1_GetStatus
};
#endif

// SPI2
#ifdef MX_SPI2
static int32_t        SPI2_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI2_Resources); }
static int32_t        SPI2_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI2_Resources); }
static int32_t        SPI2_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI2_Resources); }
static int32_t        SPI2_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI2_Resources); }
static int32_t        SPI2_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI2_Resources); }
static int32_t        SPI2_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI2_Resources); }
static uint32_t       SPI2_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI2_Resources); }
static int32_t        SPI2_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI2_Resources); }
static ARM_SPI_STATUS SPI2_GetStatus           (void)                                              { return SPI_GetStatus (&SPI2_Resources); }
       void           SPI2_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI2_Resources); }

#ifdef MX_SPI2_TX_DMA_Instance
static void           SPI2_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI2_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI2_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI2_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi2_tx);
}
#endif
#endif
#ifdef MX_SPI2_RX_DMA_Instance
static void           SPI2_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI2_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI2_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI2_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi2_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI2 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI2_Initialize,
  SPI2_Uninitialize,
  SPI2_PowerControl,
  SPI2_Send,
  SPI2_Receive,
  SPI2_Transfer,
  SPI2_GetDataCount,
  SPI2_Control,
  SPI2_GetStatus
};
#endif

// SPI3
#ifdef MX_SPI3
static int32_t        SPI3_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI3_Resources); }
static int32_t        SPI3_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI3_Resources); }
static int32_t        SPI3_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI3_Resources); }
static int32_t        SPI3_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI3_Resources); }
static int32_t        SPI3_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI3_Resources); }
static int32_t        SPI3_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI3_Resources); }
static uint32_t       SPI3_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI3_Resources); }
static int32_t        SPI3_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI3_Resources); }
static ARM_SPI_STATUS SPI3_GetStatus           (void)                                              { return SPI_GetStatus (&SPI3_Resources); }
       void           SPI3_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI3_Resources); }

#ifdef MX_SPI3_TX_DMA_Instance
static void           SPI3_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI3_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI3_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI3_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi3_tx);
}
#endif
#endif
#ifdef MX_SPI3_RX_DMA_Instance
static void           SPI3_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI3_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI3_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI3_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi3_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI3 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI3_Initialize,
  SPI3_Uninitialize,
  SPI3_PowerControl,
  SPI3_Send,
  SPI3_Receive,
  SPI3_Transfer,
  SPI3_GetDataCount,
  SPI3_Control,
  SPI3_GetStatus
};
#endif

// SPI4
#ifdef MX_SPI4
static int32_t        SPI4_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI4_Resources); }
static int32_t        SPI4_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI4_Resources); }
static int32_t        SPI4_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI4_Resources); }
static int32_t        SPI4_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI4_Resources); }
static int32_t        SPI4_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI4_Resources); }
static int32_t        SPI4_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI4_Resources); }
static uint32_t       SPI4_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI4_Resources); }
static int32_t        SPI4_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI4_Resources); }
static ARM_SPI_STATUS SPI4_GetStatus           (void)                                              { return SPI_GetStatus (&SPI4_Resources); }
       void           SPI4_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI4_Resources); }

