Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.c
#ifdef MX_SPI4_TX_DMA_Instance
static void           SPI4_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI4_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI4_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI4_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi4_tx);
}
#endif
#endif
#ifdef MX_SPI4_RX_DMA_Instance
static void           SPI4_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI4_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI4_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI4_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi4_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI4 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI4_Initialize,
  SPI4_Uninitialize,
  SPI4_PowerControl,
  SPI4_Send,
  SPI4_Receive,
  SPI4_Transfer,
  SPI4_GetDataCount,
  SPI4_Control,
  SPI4_GetStatus
};
#endif

// SPI5
#ifdef MX_SPI5
static int32_t        SPI5_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI5_Resources); }
static int32_t        SPI5_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI5_Resources); }
static int32_t        SPI5_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI5_Resources); }
static int32_t        SPI5_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI5_Resources); }
static int32_t        SPI5_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI5_Resources); }
static int32_t        SPI5_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI5_Resources); }
static uint32_t       SPI5_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI5_Resources); }
static int32_t        SPI5_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI5_Resources); }
static ARM_SPI_STATUS SPI5_GetStatus           (void)                                              { return SPI_GetStatus (&SPI5_Resources); }
       void           SPI5_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI5_Resources); }

#ifdef MX_SPI5_TX_DMA_Instance
static void           SPI5_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI5_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI5_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI5_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi5_tx);
}
#endif
#endif
#ifdef MX_SPI5_RX_DMA_Instance
static void           SPI5_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI5_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI5_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI5_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi5_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI5 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI5_Initialize,
  SPI5_Uninitialize,
  SPI5_PowerControl,
  SPI5_Send,
  SPI5_Receive,
  SPI5_Transfer,
  SPI5_GetDataCount,
  SPI5_Control,
  SPI5_GetStatus
};
#endif

// SPI6
#ifdef MX_SPI6
static int32_t        SPI6_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI6_Resources); }
static int32_t        SPI6_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI6_Resources); }
static int32_t        SPI6_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI6_Resources); }
static int32_t        SPI6_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI6_Resources); }
static int32_t        SPI6_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI6_Resources); }
static int32_t        SPI6_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI6_Resources); }
static uint32_t       SPI6_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI6_Resources); }
static int32_t        SPI6_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI6_Resources); }
static ARM_SPI_STATUS SPI6_GetStatus           (void)                                              { return SPI_GetStatus (&SPI6_Resources); }
       void           SPI6_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI6_Resources); }

#ifdef MX_SPI6_TX_DMA_Instance
static void           SPI6_TX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_TX_DMA_Complete (&SPI6_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI6_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI6_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi6_tx);
}
#endif
#endif
#ifdef MX_SPI6_RX_DMA_Instance
static void           SPI6_RX_DMA_Complete     (DMA_HandleTypeDef *hdma)                           { (void)hdma; SPI_RX_DMA_Complete(&SPI6_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void SPI6_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_SPI6_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_spi6_rx);
}
#endif
#endif

ARM_DRIVER_SPI Driver_SPI6 = {
  SPIX_GetVersion,
  SPIX_GetCapabilities,
  SPI6_Initialize,
  SPI6_Uninitialize,
  SPI6_PowerControl,
  SPI6_Send,
  SPI6_Receive,
  SPI6_Transfer,
  SPI6_GetDataCount,
  SPI6_Control,
  SPI6_GetStatus
};
#endif

/*! \endcond */
